Revit 2027 API
Document.NewAreaBoundaryConditions Method
 Creates a new Area BoundaryConditions element.
Overload List
Name | Description
NewAreaBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Obsolete.
 Creates a new Area BoundaryConditions element on a host element.
NewAreaBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) | Obsolete.
 Creates a new Area BoundaryConditions element on a reference.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace